{
  "fileName": "ErgoHistoryReader.scala",
  "filePath": "src/main/scala/org/ergoplatform/nodeView/history/ErgoHistoryReader.scala",
  "url": "https://github.com/ergoplatform/ergo/src/main/scala/org/ergoplatform/nodeView/history/ErgoHistoryReader.scala",
  "summary": "The `ErgoHistoryReader` trait provides a read-only view of the Ergo blockchain history. It is responsible for managing and validating the history of block headers, block sections, and extra indices. It also provides methods for comparing the local node's history with that of other nodes, and for constructing PoPoW (Proof of Proof of Work) proofs.\n\nThe main functionality includes:\n\n- Retrieving the best header, best full block, and block sections by their IDs.\n- Checking if a block section is applicable to the history.\n- Comparing the local node's history with another node's history using `compare` and `compareV1`/`compareV2` methods. These methods return a `PeerChainStatus` indicating if the other node is ahead, behind, on a fork, or has the same history.\n- Calculating the continuation of headers to be sent to another node using `continuationIdsV1` and `continuationIdsV2` methods. These methods return a sequence of header IDs that the other node should download and apply to synchronize with the local node.\n- Finding common blocks and subchains between two headers using `commonBlockThenSuffixes` method.\n- Constructing PoPoW headers and proofs using `popowHeader` and `popowProof` methods.\n\nExample usage:\n\n```scala\nval historyReader: ErgoHistoryReader = ...\nval syncInfo: ErgoSyncInfo = ...\n\n// Compare the local node's history with another node's history\nval peerChainStatus = historyReader.compare(syncInfo)\n\n// Calculate the continuation of headers to be sent to another node\nval continuationIds = historyReader.continuationIds(syncInfo, size = 10)\n\n// Check if a block section is applicable to the history\nval blockSection: BlockSection = ...\nval isApplicable = historyReader.applicable(blockSection)\n```\n\nThis trait is essential for maintaining the consistency and integrity of the Ergo blockchain, as it allows nodes to synchronize their histories and validate new blocks and block sections.",
  "questions": "1. **What is the purpose of the `ErgoHistoryReader` trait?**\n\n   The `ErgoHistoryReader` trait is a read-only copy of ErgoHistory that provides various methods to access and manipulate the history of the Ergo blockchain. It allows developers to query the history, compare it with other nodes, and validate and apply modifiers to the history.\n\n2. **How does the `compare` method work and what is its purpose?**\n\n   The `compare` method takes an `ErgoSyncInfo` object as input and determines the synchronization status of the current node with respect to another node's history. It returns a `PeerChainStatus` value, which can be `Equal`, `Younger`, `Older`, `Fork`, or `Unknown`. This information is useful for deciding whether the current node needs to synchronize with the other node or not.\n\n3. **What is the purpose of the `applicableTry` method?**\n\n   The `applicableTry` method checks if a given `BlockSection` modifier can be applied to the history. It returns a `Success` if the modifier can be applied, and a `Failure(ModifierError)` if it cannot be applied. This method is useful for validating incoming modifiers before applying them to the history."
}